In [1]:
import pandas as pd

In [2]:
import seaborn as sns

In [6]:
df=sns.load_dataset("titanic")

In [8]:
df=df.drop(columns=['survived', 'pclass', 'sex', 'sibsp', 'parch', 'fare', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'])

In [10]:
df

      age embarked
0    22.0        S
1    38.0        C
2    26.0        S
3    35.0        S
4    35.0        S
..    ...      ...
886  27.0        S
887  19.0        S
888   NaN        S
889  26.0        C
890  32.0        Q

[891 rows x 2 columns]

In [11]:
df.isnull().sum()

age         177
embarked      2
dtype: int64

In [15]:
from sklearn.impute import SimpleImputer

# for Numerical columns

In [16]:
si=SimpleImputer(strategy="mean")

In [18]:
df_age=si.fit_transform(df[["age"]])

In [20]:
age_df=pd.DataFrame(df_age)

In [22]:
age_df.isnull().sum()

0    0
dtype: int64

# for categorical columns

In [24]:
si=SimpleImputer(strategy="most_frequent")

In [25]:
df_emb=si.fit_transform(df[["embarked"]])

In [26]:
emb_df=pd.DataFrame(df_emb)

In [29]:
emb_df.isnull().sum()

0    0
dtype: int64